# Задача «Длина слова».
a = 'Hi!'
print(len(a))

# Задача «Суммы и разности».
first = 42
second = 43
summa = first + second
diff = second - first
print(summa)
print(diff)

# Задача «Среднее арифметическое».
first = 42
second = 43
third = 44
mean = (first + second + third) / 3
print(mean)

# Задача «Простые строчки».
first_string = "Вторник"
second_string = "Понедельник"
print(second_string + ',', first_string)

# Задача «Сложная формула».
a = 1
b = 2
c = 3
f = ((a * b) + (a * c)) ** 3 / 2
print(f)

# Базовые занятия завершились.
